update use case diagram
